20alex02/frdmk66f/FRDM_K66F_LCD1602_Template/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_SDCARD_CARD_DETECTION_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define BOARD_SDCARD_CARD_DETECTION_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SDCARD_CARD_DETECTION_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_SDCARD_CARD_DETECTION_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_SDCARD_CARD_DETECTION_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHC0Pins(void);

#define SOPT2_RMIISRC_ENET 0x01u /*!<@brief RMII clock source select: External bypass clock (ENET_1588_CLKIN). */

/*! @name PORTE26 (coord K4), U13[16]/ETHERNET_CLOCK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_ETHERNET_CLOCK_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_ETHERNET_CLOCK_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_ETHERNET_CLOCK_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTA14 (coord L10), U13[15]/RMII0_CRS_DV
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_RMII0_CRS_DV_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_RMII0_CRS_DV_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_RMII0_CRS_DV_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTB1 (coord H9), U13[11]/RMII0_MDC
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_RMII0_MDC_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_RMII0_MDC_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_RMII0_MDC_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORTB0 (coord H10), U13[10]/RMII0_MDIO
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_RMII0_MDIO_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_RMII0_MDIO_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_RMII0_MDIO_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORTA13 (coord J9), U13[13]/RMII0_RXD0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_RMII0_RXD0_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_RMII0_RXD0_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_RMII0_RXD0_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTA12 (coord K9), U13[12]/RMII0_RXD1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_RMII0_RXD1_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_RMII0_RXD1_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_RMII0_RXD1_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTA5 (coord M8), U13[17]/RMII0_RXER
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_RMII0_RXER_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_RMII0_RXER_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_RMII0_RXER_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORTA16 (coord K10), U13[20]/RMII0_TXD_0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_RMII0_TXD_0_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_RMII0_TXD_0_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_RMII0_TXD_0_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTA17 (coord K11), U13[21]/RMII0_TXD_1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_RMII0_TXD_1_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_RMII0_TXD_1_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_RMII0_TXD_1_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTA15 (coord L11), U13[19]/RMII0_TXEN
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_RMII0_TXEN_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_RMII0_TXEN_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_RMII0_TXEN_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTE26 (coord K4), U13[16]/ETHERNET_CLOCK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_ENET_1588_CLKIN_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_ENET_1588_CLKIN_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_ENET_1588_CLKIN_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENETPins(void);

/*! @name USB1_DM (coord K1), K66_MICRO_USB_DN
  @{ */
/* @} */

/*! @name USB1_DP (coord J1), K66_MICRO_USB_DP
  @{ */
/* @} */

/*! @name PORTE10 (coord F1), USB_ID
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_USB_ID_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_USB_ID_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_USB_ID_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name USB1_VBUS (coord L1), P5V_K66_USB
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBPins(void);

/*! @name PORTA18 (coord M12), EXTAL0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_EXTAL0_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_EXTAL0_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_EXTAL0_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA19 (coord M11), X501[3]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_XTAL0_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_XTAL0_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_XTAL0_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                              /* @} */

