20alex02/frdmk66f/FRDM_K66F_LCD1602_Template/board/pin_mux.h
/*! @name EXTAL32 (coord M6), Y3[2]
  @{ */
/* @} */

/*! @name XTAL32 (coord M7), Y3[1]
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCsPins(void);

/*! @name PORTA27 (coord J10), J3[1]/FB_A26
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_RS_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define LCD_RS_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_RS_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define LCD_RS_PIN 27U                   /*!<@brief PORT pin number */
#define LCD_RS_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTA26 (coord J11), J3[3]/FB_A27
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_RW_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define LCD_RW_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_RW_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define LCD_RW_PIN 26U                   /*!<@brief PORT pin number */
#define LCD_RW_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTA4 (coord L7), J3[5]/LLWU_P3/FTM0_CH1/NMI
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_E_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define LCD_E_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_E_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define LCD_E_PIN 4U                   /*!<@brief PORT pin number */
#define LCD_E_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name PORTA6 (coord J7), J3[7]/CLKOUT
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_DB4_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define LCD_DB4_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_DB4_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define LCD_DB4_PIN 6U                   /*!<@brief PORT pin number */
#define LCD_DB4_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTA7 (coord J8), J3[9]/FTM0_CH4/TRACE_D3
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_DB5_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define LCD_DB5_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_DB5_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define LCD_DB5_PIN 7U                   /*!<@brief PORT pin number */
#define LCD_DB5_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTA8 (coord K8), J3[11]/FTM1_CH0/TRACE_D2
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_DB6_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define LCD_DB6_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_DB6_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define LCD_DB6_PIN 8U                   /*!<@brief PORT pin number */
#define LCD_DB6_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name PORTA9 (coord L8), J3[13]/FTM1_CH1/TRACE_D1
  @{ */

/* Symbols to be used with GPIO driver */
#define LCD_DB7_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define LCD_DB7_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define LCD_DB7_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define LCD_DB7_PIN 9U                   /*!<@brief PORT pin number */
#define LCD_DB7_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                         /* @} */

/*! @name DAC0_OUT (coord L3), J4[11]/DAC_OUT
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LCD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
